Web Services/1. Webservice Testing/Transactions/findTransactions/Test Case 3/WS_Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tran="http://www.hmco.com/EAI/OTS/Transaction">
   <soapenv:Header/>
   <soapenv:Body>
      <tran:transactionSearchCriteria>
       
              <tran:limitOfResults>10</tran:limitOfResults>
         <!--Optional:-->
    
       <tran:customerID>0000328966</tran:customerID>
         
        
         <!--Optional:-->
         
        <tran:materialID>5741466</tran:materialID>

        
       
         <tran:zipCode>36609</tran:zipCode>
       <tran:partnerFunctionList>
            <!--1 or more repetitions:-->
           <tran:partnerFunction>PARTNER_FUNCTION_SHIPTO</tran:partnerFunction>
	<tran:partnerFunction>PARTNER_FUNCTION_BILLTO</tran:partnerFunction>
<tran:partnerFunction>PARTNER_FUNCTION_SOLDTO</tran:partnerFunction>
         
         </tran:partnerFunctionList>
      </tran:transactionSearchCriteria>
   </soapenv:Body>
</soapenv:Envelope>